# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [3]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute('''select name from sqlite_master where type="table"''').fetchall()

[('orderdetails',),
 ('payments',),
 ('offices',),
 ('customers',),
 ('orders',),
 ('productlines',),
 ('products',),
 ('employees',)]

In [5]:
cur.execute('''
SELECT lastName, firstName 
FROM employees 
JOIN offices 
USING(officeCode) 
WHERE city = 'Boston';''').fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [16]:
#Your code here
cur.execute('''
SELECT * FROM offices 
JOIN employees USING(officeCode) 
ORDER BY employeeNumber ASC 
LIMIT 1''').fetchall()

[('1',
  'San Francisco',
  '+1 650 219 4782',
  '100 Market Street',
  'Suite 300',
  'CA',
  'USA',
  '94080',
  'NA',
  '1002',
  'Murphy',
  'Diane',
  'x5800',
  'dmurphy@classicmodelcars.com',
  '',
  'President')]

In [30]:
cur.execute("""select city,
                    count(*)
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1;""")
df = pd.DataFrame(cur.fetchall())
df.head(10)

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [21]:
# What are the 3 most expensive products?
cur.execute("""select productName,
                    buyPrice
                    from products
                    order by buyPrice DESC
                    limit 3;""")
df = pd.DataFrame(cur.fetchall())
df.head()

                          0      1
0  1952 Alpine Renault 1300  98.58
1   1956 Porsche 356A Coupe  98.30
2         2001 Ferrari Enzo  95.59

In [33]:
# Which are the 5 best selling products?
cur.execute("""select productName,
                    quantityOrdered
                    from products
                    left join orderdetails using(productCode)
                    order by quantityOrdered DESC
                    limit 5;""")
df = pd.DataFrame(cur.fetchall())
df

                                0   1
0              1969 Dodge Charger  97
1            1969 Dodge Super Bee  90
2  America West Airlines B757-200  85
3         1970 Plymouth Hemi Cuda  77
4              F/A 18 Hornet 1/72  77

In [52]:
# Where most of our orders come from?
cur.execute("""select city,state,country, 
                    count(*)
                    from orders
                    left join customers using(customerNumber)
                    group by city
                    order by 4 DESC
                    limit 10;""")
df = pd.DataFrame(cur.fetchall())
df.head(10)

               0   1            2   3
0         Madrid            Spain  31
1     San Rafael  CA          USA  17
2            NYC  NY          USA  16
3     Auckland        New Zealand   9
4          Paris           France   9
5      Singapore        Singapore   9
6     Brickhaven  MA          USA   8
7         Nantes           France   7
8  San Francisco  CA          USA   7
9    New Bedford  MA          USA   6

## Level Up: Display the names of each product each employee has sold.

In [73]:
# Your code here
cur.execute("""select firstName, lastName,
                      productName
                      from employees
                      join customers
                      on employees.employeeNumber = customers.salesRepEmployeeNumber
                      join orders using(customerNumber)
                      join orderdetails using(orderNumber)
                      join products using(productCode)""")
df = pd.DataFrame(cur.fetchall())
df.head(10)

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang
5  Leslie  Jennings                           1968 Dodge Charger
6  Leslie  Jennings                      1970 Plymouth Hemi Cuda
7  Leslie  Jennings                           1969 Dodge Charger
8  Leslie  Jennings                  1948 Porsche 356-A Roadster
9  Leslie  Jennings                         1969 Dodge Super Bee

## Level Up: Display the Number of Products each Employee Has sold

In [76]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!